let films = [
    {   
        name: "Винченцо" , 
        duration: "1 сезонив,20серий", 
        marks:8.9, 
        actors:"Ким Соль Джин, Ли Хан На, Ким Ё Чжин,Квак Дон Ён, Ким Юн Хе, Ок Тэк Ён,", 
        image:"v1.jpg",
        genre:"Криминал",
        about:"Пак Чжу Хён, который с восьми лет был усыновлён итальянской семьёй и жил, и воспитывался в Италии. Он не только изменил своё имя на Винченцо Кассано (Сон Джун Хён), но и стал адвокатом мафии. Обаятельный и умный юрист мог профессионально вести переговоры. После начала войны в мафиозных кругах, итальянский адвокат Винченцо возвращается на родину и встречается с достойным соперником, лучшим местным адвокатом Хон Ча Ён (Чо Ё Бин), работающая в крупной юридической фирме Усан. Она готова на всё для того, чтобы не проиграть дело. Её помощник - умный и трудолюбивый юрист-стажёр Чан Джун У (Ок Тэк Ён), который восхищён своим наставником и полностью доверяет ей. Винченцо добивается справедливости своим путем. В своей работе он сталкивается с достойным противником, главой группы «Вавилон», Чан Хансо (Квак Дон Ён), по натуре жестокой и не признающей поражения. Одним словом, эта история о хладнокровном обольстителе, готовый пойти на всё ради победы ",
        
    },
    {   
        name: 'Псих, но все в порядке', 
        duration: "1 сезонив,16серий", 
        marks:9.4, 
        actors:"Пак Гю Ён, Кан Ки Дун, Чан Ён Нам, О Чжон Се,Ли Оль, У Чон Вон,", 
        image:"p1.jpg",
        genre:"Комедия",
        about:"Мун Кан Тхэ работает в больнице, в психиатрическом отделении. У него множество положительных качеств, а также он очень красив. У него есть старший брат, который страдает аутизмом. Главная героиня Го Мун Ён является автором детских книг и у нее антисоциальное расстройство личности. Из-за травм детства, она выросла высокомерной и эгоистичной женщиной.",
    },
    {   
        name: 'Пентхаус ', 
        duration:"2 сезонив,21серий" , 
        marks:9.9, 
        actors:"Щин Ын-гён, Ом Ги-джун, Ким Со-ён, Юджин, Пак Ын-сок, Пак Ын-сок",
        image:"Penthouse.jpg",
        genre:"драма",
        about:"Дорама  расскажет о жизни людей, проживающих в высотке, в самом дорогом районе Сеула - Каннаме. Главная героиня мечтает о том, чтобы жить в высотке, вместе с самыми богатыми и влиятельными людьми. Но добиться этого не так просто. Порой, нужно идти на крайние меры и совершать плохие поступки. И чем ближе женщина к своей цели, тем больше она становится похожа на монстров, живущих в этом небоскребе.",
    },
    {   
        name: 'Школьница с бензопилой', 
        duration: "76 минут", 
        marks:4.0, 
        actors:"Тамаки Юки, Ямати Мари, Сато Сэйра, Учида Рио, Окуда Каяко ", 
        image:"db1.jpg",
        genre:"драма, ужасы",
        about:"Нокомура Гико не самая прилежная ученица средней школы. Однажды ей приходится вступить в кровавую схватку с зомби, которые когда-то были ее одноклассниками.",
    },
    {   
        name: ' Девушка из ниоткуда', 
        duration: "2 сезонив,13серий", 
        marks:7.9, 
        actors:"Чича Аматаякул,Кунчануджу Киндракарнаa,Моракот Лю ", 
        image:"dv1.jpg",
        about:"Главная героиня сериала с виду может показаться милой и доброй девушкой. Ее живой ум и невероятная красота вводят в заблуждение многих людей. Нанно переходит из школы в школу. Она не ищет идеальное место, а играет. Играет с людьми и их судьбами, пытаясь обмануть тех и надавить, выявляя их слабые стороны. Испытание соблазном никто не может пройти. К тому же Нанно иногда использует свои потусторонние способности, заставляющие мертвых людей восставать из могил и совершать странные поступки. Главная героиня воспринимает происходящее как развлечение. Однако она даже не представляет, чем ее шалости могут обернуться.",
    },
    {   
        name: 'Истинная красота', 
        duration: "1 сезонив,16серий", 
        marks:9.4, 
        actors:" Чха Ын У, Хван Ин Ёп, Пак Ю На, Мун Га-ён, Щин Джэ-хви", 
        image:"ik1.jpg",
        genre:"комедия,романтика",
        about:"дорама рассказывает о молодой девушке, которая страдающая своей внешности и вынужденная терпеть издевательства одноклассников, обратилась к помощи искусству макияжа. Вскоре она влюбляется в Ли Су Хо, юношу, который видел её без косметики. Бедная девушка вынуждена была выполнять все его поручения, чтобы он не взболтнул лишнего. Девушка понимала, что они никогда не будут вместе, так как красивый и умный парень пользуется большой популярностью у девушек. Ранее, он никогда не влюблялся и, даже не смотрел в сторону девушек. Ли не интересуют девушки, сразу бросающиеся на шею. Не смотря на его вспыльчивый характер, он добросердечный парень. Его интересуют скромные девушки, такие как наша героиня, которой не рискует признаться в этом. Будут ли наши герои вместе? Кто первым сделает своё признание? В это время, наша героиня встречает ещё одного красивого парня, который, не зная её тайны, проявлял к ней интерес. Видимо появляется любовный треугольник…",
    },
    {   
        name: "Уведомление о любви", 
        duration: "2 сезонив,8 серий", 
        marks:7.3, 
        actors:"Ким Со-хёнЧон Га-рамСон", 
        image:"ly1.jpg",
        genre:"мелодрамы",
        about:"Сюжет этой увлекательной дорамы предлагает зрителям затянуться в самый непредсказуемый и неожиданный любовный треугольник. В центре внимания сюжета оказывается простая студентка и двое молодых людей, каждый из которых по-своему влюблён в девушку. Кажется, что отношения выглядят весьма типичными и обыденными, однако искринку и перчика в происходящего добавляют личности действующих персонажей. Она - классический трудоголик, который привык большую часть времени отдавать своей работе. Один из персонажей - парень с горячим сердцем и открытой душой, который лишь внешне выглядит холодно. Второй молодой человек отличается милым и добрым характером: он умеет быть заботливым и по-настоящему любящим. Кажется, что оба персонажа отлично подойдут главной героине, однако выбрать крайне непросто. Правда, парни пока не спешат рассказывать о своих чувствах. Неожиданным делает сюжет тот факт, что на телефоне главной героини будет установлено приложение, которое сообщит владелице устройства о том, что в радиусе десяти метров находится кто-то, кому она не безразлична. Речь пойдёт, конечно же,о настоящей любви. Что же будет дальше в этом удивительном и интересном комедийно-мелодраматичном сериале?",
    },
    {   
        name: ' Итэвон класс', 
        duration: "2 сезонив,8 серий", 
        marks:8.9, 
        actors:"Нара, Ю Джэ-мён, Пак Со-джун, Рю Гён-су, Ким Да-м", 
        image:"it1.jpg",
        genre:"мелодрамы",
        about:"Дорама рассказывает историю о молодых людей, которые восстают против несправедливости этого мира. Их мир - это район в Сеуле, где они открывают собственный бизнес. Главный герой Пак Се Рой еще не отошел от смерти отца, который владел небольшой закусочной. После его смерти, Се Рой решает открыть свой ресторан, но найдутся те, кто будет ему мешать. Чо Исо - высокоинтеллектуалка и социопат. Она известна, как звезда социальных сетей и блогер. Внешне, она ангел, но на самом деле сущее зло. Первое знакомство героев прошло не очень хорошо, но им придется работать вместе.",
    },
    {   
        name: 'Френдзона',  
        duration:"1 сезонив,12 серий" , 
        marks:5.6, 
        actors:"Ай Саранчана Апасимаиманкул, Намтан Типнари", 
        image:"fr1.jpg",
        genre:"мелодрамы",
        about:"Молодые ребята, главные герои лакорна - это все мы, которые любят и ненавидят, дружат и ругаются, пытаются найти свое место в мире, и наконец-то разобраться, чего хотят от жизни. Бум и Тор не могут наладить отношения, Стад принимает лишь отношения на одну ночь, Бойо теряет парня, а Эрт ищет себе новое жилье и тут ему предлагает пожить у себя друг. Все запутанно, но очень интересно, чем закончиться...",
    },
    {   
        name: 'Отель Дель Луна', 
        duration:"1 сезонив,22 серий" , 
        marks:8.3, 
        actors:"Чжи Ын Ли,Чжин Гу Ё ,Нам Да Рым, ", 
        image:"lyna1.jpg",
        genre:"фантастические",
        about:"Потрясающий сериал обещает зрителям незабываемые эмоции и прекрасное времяпровождение за историей, окутанной мистикой и многочисленными тайнами. В центре внимания сюжета оказывается Ко Чхан Сон. Молодой человек просто искал работу и понял, что лучшим решением будет воровство и грабёж, ведь ничего особенного тот не умеет, а сына каким-то образом прокормить нужно. Убегая от полиции с награбленным, мужчина приходит в удивительное заведение, выглядящее невероятно. Главные действующие лица этого сериала - работники этого отеля и его управляющие. Сначала Ко Чхан Сон не обращает особого внимания на происходящее вокруг, потому что пытается убедить себя в том, что нашёл идеальную работу по душе. Кто бы мог подумать, что здесь главному герою повстречаются люди, которые не должны находиться в этих стенах. Правда, уходить из номеров и заведения они не собираются, потому что прописались здесь бессрочно. Речь идет о местных призраках, захвативших власть в этих стенах. Правда, помощи молодому человеку в борьбе с ними не окажут. Управляющая Чжан Ман Воль хоть и выглядит милой и привлекательной, постоянно занята своими делами. Она тоже не так проста, как кажется. Главная героиня уже тысячу лет находится в стенах этого здания. Она проклята.",
    },
    {   
        name: 'Вспоминай,Ха Ри ', 
        duration:"2 сезонив,10 серий" , 
        marks:7.1, 
        actors:"Пак Чжи Йе, Ли Дон Гиль                                                         ", 
        image:"xary1.jpg",
        genre:"фэнтези",
        about:"Как-то раз, для школьного проекта школьница Ха Ри приглашает в свою команду парня Джу Мина, чтобы дела шли быстрее. Но вот про героя в школе ходят странные слухи. Поговаривают, что парень видит призраков, а те, кто буду с ним общаться так же начнут видеть всякую всячину. Ха Ри это не испугало, да и на деле Джу оказался добрым и общительным. Вот только уже ближе к вечеру девушка осознала - возможно, все разговоры истинная правда. Ей привиделся какой-то парень и сказал, что они уже были знакомы. Но призрак ли это? Или проделки одноклассника?",
    },
    {   
        name: 'Хваюги', 
        duration:"1 сезонив,30 серий" , 
        marks:9.5, 
        actors:"Чан Гван, Ли Эль, О Ён-со Ли Сын-ги,Чха Сын-вон", 
        image:"xvaygu1.jpg",
        genre:"комедия, приключения",
        about:"С детства Самджан обладает уникальным даром, который только портит ее жизнь. Ее способность видеть демонов и понимать их язык пугает окружающих. Самджан никогда не имела друзей, так как ее поведение выглядело странным. Однажды она столкнулась со злым богом Сан О Гоном, который обманом вынудил девушку вызволить его из тысячелетнего заточения. Вместо обещанной защиты от демонов бог стирает свой облик из сознания девушки навсегда. Прошли годы, теперь девушка стала успешной бизнес-леди, успешно проворачивающей любые сделки. Но ее по-прежнему преследуют злые духи. Она научилась противостоять им, но остался один против которого ее силы блекнут. Чин Сан еще не знает, что вскоре ей суждено повстречать бога Сан О Гона вновь.",
    },



];

let app = {
    data() {
        return {
            films:films,
            searchString:'',
            currentIndex: -1,
            modalNum:-1,
            showPr: true,
        }
    },
    methods: {
        modalShow(index){
            this.currentIndex = index;
        }, 
        modalHide(){
            this.currentIndex = -1;
        },
        showDetail(index) {
            this.modalNum = index;
        },
        hideDetail(){
            this.modalNum = -1
        },
        showPreloader(){
            setTimeout(()=>{
                this.showPr = false;
            }, 1000)
        },
        
    },
    mounted() {
        this.showPreloader()
    },
    computed: {
        myFilter(){
            let search = this.searchString;//скорочуємо змінну
            if (!search){//якщо змінна пуста
                return this.films;//показуємо всі фільми
            }
            search = search.trim().toLowerCase();//обрізаємо пробіли і малі букви робимо

            return this.films.filter(//запускаємо фільтр
                item => {//кожен асоціативний масивчик (один фільм)
                    if (item.name.toLowerCase().indexOf(search) != -1){
                        return item;//фільми, що підходять
                    }
                })
        }
    },

    

}
Vue.createApp(app).mount("#film-app")

