let films = [
    {   
        name: "Агент времени" , 
        duration: "5/11серий", 
        marks:7.93, 
        actors:"Гуан Лу Сяоши Чэн ", 
        image:"av1.jpg",
        genre:"Драма, Супер сила, Фэнтези",
        about:"В одном из уголков процветающей столицы всё ещё работает маленькое фотоателье под названием «Время». Пусть там немноголюдно, но им управляют два мужчины с необычными способностями — Чэн Сяоши и Лу Гуан. По просьбе одного из клиентов Лу Гуан и Чэн Сяоши при помощи суперспособностей попадают внутрь фотографии, но затем дела принимают совершенно неожиданный оборот... ",
        
    },
    {   
        name: 'Сальто назад!', 
        duration: "9/12серий", 
        marks:9.0, 
        actors:"ZEXCS", 
        image:"22-1.jpg",
        genre:"Спорт",
        about:"Это история о Сётаро Футабу, старшекласснике, который на последнем году обучения в средней школе загорелся таким видом спорта, как мужская художественная гимнастика. Когда Сётаро зачислили в частную академию Сосюкан, он вступил в кружок мужской художественной гимнастики. В нём он, вместе с остальными участниками клуба, стремится добиться общей цели.",
    },
    {   
        name: 'Нулевой Эдем', 
        duration:"8/25серий", 
        marks:7.9, 
        actors:"Хиро Масима", 
        image:"27-1.jpg",
        genre:"Комедия, Космос, Приключения, Сёнэн, Фантастика, ",
        about:"События сериала разворачиваются вокруг мальчишки по имени Шики, живущего на Гранбелле. Гранбелл — это планета, заселённая роботами, где каждый из них выполняет отведённую ему роль. От того одинокая душа единственного живого обитателя роботизированной планеты преисполнена желанием найти себе много хороших друзей. Однажды на родину Шики прибывает девушка Ребекка вместе со своим питомцем, котом Хэппи, с целью записать видео для своего канала. После радушного приёма от местных жителей она встречает Шики, который сразу же протягивает ей руку дружбы. Это знаменует начало головокружительных событий и приключений, участниками которых станет эта парочка.",
        
    },
    {   
        name: 'Шаман Кинг', 
        duration:"10/52ерий" , 
        marks:8.5, 
        actors:"Такэи Хироюки ", 
        image:"24-1.jpg",
        genre:"Комедия, Приключения, Сверхъестественное, Сёнэн ",
        about:" Мир всегда таил в себе мистику и множество загадок. Только со временем вера в сверхъестественное в сердцах людей угасла, и они перестали видеть существующих в мире духов. Однако несмотря на это, ещё остались те, кто сохранил в себе веру и не утратил способности — шаманы. Они могут не только видеть и слышать духов, но и контактировать с ними, а также управлять.Одним из таких людей является главный герой этой истории Йо Асакура. Всю жизнь паренёк посвятил тренировкам, ведь в скором времени ему предстоит участие в великом соревновании — Турнире Шаманов, который проходит раз в пятьсот лет. Это испытание определит самого сильного шамана, достойного объединиться с Королём Духов, сильнейшим духом в мире. Победитель получит титул Короля Шаманов, который дарует безграничное могущество и возможность управлять всей жизнью на Земле. Пройти это нелёгкое испытание Йо будет ой как не просто, но он вложит все силы в достижение цели! А помогать ему и поддерживать на пути к победе будут лучший друг Манта и преданный дух-хранитель Амидамару. ",
    },
    {   
        name: 'Супер Каб', 
        duration:"9/12серий" , 
        marks:8.8, 
        actors:"Тонэ Кокэн ", 
        image:"25-1.jpg",
        about:" Представьте себе, что у вас забрали всё самое ценное: друзей и родителей… Именно это произошло у Когумы в жизни: её отец умер, когда та была ещё маленькой, её родная мать внезапно ушла из дома, а одноклассники стали избегать сироту. Такая жизнь у Когумы могла продолжаться долго, если бы одним летним днём случайная встреча не привела девушку к магазину, где она покупает поддержанный скутер Хонда Супер Каб со смутной историей… После покупки скутера Когума, ездя на нём каждый день в школу, знакомится с Рэйко, которая со временем становится её первой настоящей подругой.",
    },

    {   
        name: 'Би: Начало 2', 
        duration:" 2 сезон 6/?" , 
        marks:7.5, 
        actors:"Production I.G", 
        image:"26-1.jpg",
        genre:"Детектив, Полиция, Психологическое, Сверхъестественное",
        about:"В будущем технологический прогресс и наука, безусловно, не остановились на одном месте. Люди получили возможность совершить настоящую искусственную революцию. Ученые развернули эксперимент, в ходе которого должен появиться новейший человеческий вид. Цель необычного опыта – сохранение спокойствия и жизни на всей планете. Когда грандиозный проект приближался к логическому финалу, могущественная преступная организация похитила полученные результаты. После непредвиденного инцидента прошло восемь лет. Сюжетная линия разворачивается вокруг специальной команды, занимающейся расследованиями.Кит Флик – талантливый и невероятно популярный следователь, являющийся истинным мастером своего дела. Киллер Би – выдающаяся персона криминальной области. Этот ловкий преступник на протяжении многих лет удерживает в страхе городских жителей. Правохранитель давно занимается делом, связанным с Фликом. Однажды ему удается наткнуться на загадочный факт похищения. Опытный страж порядка догадывается, что его противник и происшествие из прошлого как-то связаны.",
    },


   
   
];
   


let app = {
    data() {
        return {
            films:films,
            searchString:'',
            currentIndex: -1,
            modalNum:-1,
            showPr: true,
        }
    },
    methods: {
        modalShow(index){
            this.currentIndex = index;
        }, 
        modalHide(){
            this.currentIndex = -1;
        },
        showDetail(index) {
            this.modalNum = index;
        },
        hideDetail(){
            this.modalNum = -1
        },
        
        showPreloader(){
            setTimeout(()=>{
                this.showPr = false;
            }, 1000)
        },
        
    },
    mounted() {
        this.showPreloader()
    }, 
  
   
    computed: {
        myFilter(){
            let search = this.searchString;//скорочуємо змінну
            if (!search){//якщо змінна пуста
                return this.films;//показуємо всі фільми
            }
            search = search.trim().toLowerCase();//обрізаємо пробіли і малі букви робимо

            return this.films.filter(//запускаємо фільтр
                item => {//кожен асоціативний масивчик (один фільм)
                    if (item.name.toLowerCase().indexOf(search) != -1){
                        return item;//фільми, що підходять
                    }
                })
        }
    },

    

}
Vue.createApp(app).mount("#film-app")

